In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from pydataset import data
from scipy import stats
import env
from acquire import get_connection
from acquire import get_titanic_data
from acquire import get_iris_data
from acquire import get_telco_data
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
import warnings
warnings.filterwarnings("ignore")

In [2]:
def get_summary(df):
    '''
    get all the descriptive information needed from a given dataframe and print the results
    
    return none
    '''
    print(f'First Three Rows of Dataframe:')
    print(f'{df.head(3)}\n')
    print(f'Number of Rows and Columns in Dataframe:')
    print(f'Rows: {df.shape[0]}, Columns: {df.shape[1]}\n')
    print(f'Column Names from Dataframe:')
    print(f'{df.columns}\n')
    print('Data types from Dataframe:')
    print(f'{df.dtypes}\n')
    print('Summary of numeric variables:')
    print(f'{df.describe()}\n')

# Exercises I

### 4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables

In [3]:
df_iris = data('iris')

In [4]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [5]:
df_iris.shape

(150, 5)

In [6]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [7]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [8]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [9]:
# the smarter way, not the harder way
get_summary(df_iris)

First Three Rows of Dataframe:
   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

Number of Rows and Columns in Dataframe:
Rows: 150, Columns: 5

Column Names from Dataframe:
Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

Data types from Dataframe:
Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

Summary of numeric variables:
       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### 5. Read the data from this google sheet into a dataframe, df_google.

- print the first 3 rows
- rint the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [10]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [11]:
df_google = pd.read_csv(csv_export_url)

In [12]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [13]:
df_google.shape

(891, 12)

In [14]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [16]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [17]:
df_google.nunique()[df_google.dtypes == 'object']

Name        891
Sex           2
Ticket      681
Cabin       147
Embarked      3
dtype: int64

In [18]:
# The smarter way
get_summary(df_google)

First Three Rows of Dataframe:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

Number of Rows and Columns in Dataframe:
Rows: 891, Columns: 12

Column Names from Dataframe:
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Data types from Dataframe:
PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Summary of numeric variables:
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

### 6. Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [19]:
df_excel = pd.read_excel('/Users/jay/codeup-data-science/Classification/classification-exercises/train.xlsx')

In [20]:
df_excel_sample = df_excel.head(100)

In [21]:
df_excel.shape[0]

891

In [22]:
df_excel_sample.columns[0:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [23]:
df_excel_sample.dtypes[df_excel_sample.dtypes == 'object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [24]:
max_num = df_excel_sample.describe().max()

In [25]:
min_num = df_excel_sample.describe().min()

In [26]:
range = max_num - min_num
range

PassengerId     99.000000
Survived       100.000000
Pclass          99.183503
Age             77.170000
SibSp          100.000000
Parch          100.000000
Fare           255.775000
dtype: float64

## Make a new python module, acquire.py to hold the following data aquisition functions:
### 1.Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [27]:
get_titanic_data()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

### 2. Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [28]:
get_iris_data().head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

### 3. Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join contract_types, internet_service_types, payment_types tables with the customers table, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

In [29]:
get_telco_data().head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

### 4. Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

In [30]:
get_titanic_data?

Signature: get_titanic_data()
Docstring:
get_titanic_data will determine if 'titanic.csv' exists, if it does, it will load the dataframe titanic_db,
if it does not exist, it will write the dataframe titanic_db into a .csv
File:      ~/codeup-data-science/Classification/classification-exercises/acquire.py
Type:      function

In [31]:
get_iris_data?

Signature: get_iris_data()
Docstring:
get_iris_data will determine if 'iris.csv' exists, if it does, it will load the dataframe iris_db,
if it does not exist, it will write the dataframe iris_db into a .csv
File:      ~/codeup-data-science/Classification/classification-exercises/acquire.py
Type:      function

In [32]:
get_telco_data?

Signature: get_telco_data()
Docstring:
get_telco_data will determine if 'telco.csv' exists, if it does, it will load the dataframe telco_churn,
if it does not exist, it will write the dataframe telco_churn into a .csv
File:      ~/codeup-data-science/Classification/classification-exercises/acquire.py
Type:      function

Done!

# Exercises II

## Using the Iris Data:

### 1. Use the function defined in acquire.py to load the iris data.

In [33]:
iris = get_iris_data()

In [34]:
# attempting to work smarter

def dropped(df,columns={'sepal_length', 'petal_width'}):
    '''
    dropped will take the dataframe and remove any columns that are indicated,
    hopefully making the process faster
    '''
    iris = df.drop(columns=columns)
    return df

### 2. Drop the species_id and measurement_id columns.

In [37]:
iris = dropped(iris, columns={'species_id', 'measurement_id'})

In [38]:
iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

### 3. Rename the species_name column to just species.

In [39]:
iris = iris.rename(columns={'species_name':'species'})

In [40]:
iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

### 4. Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [41]:
dummy_df = pd.get_dummies(iris[['species']], drop_first = True).astype(int)

In [42]:
iris = pd.concat([iris,dummy_df], axis=1)
iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
0,1,1,5.1,3.5,1.4,0.2,setosa,0,0
1,1,2,4.9,3.0,1.4,0.2,setosa,0,0
2,1,3,4.7,3.2,1.3,0.2,setosa,0,0
3,1,4,4.6,3.1,1.5,0.2,setosa,0,0
4,1,5,5.0,3.6,1.4,0.2,setosa,0,0

### 5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [5]:
iris = get_iris_data()

def dropped(iris,columns={'sepal_length', 'petal_width'}):
    '''
    dropped will take the dataframe and remove any columns that are indicated,
    hopefully making the process faster
    '''
    iris = iris.drop(columns=columns)
    return iris

def prep_iris(iris):
    '''
    prep_iris will do all the cleaning we need of the database 'iris_db'.
    It will:
    - drop unnecessary columns ('species_id', 'measurement_id')
    - rename 'species_name' to 'species'
    - create dummy variables for the species name 
    - concatenate the previous dataframe to the new one with dummy variables
    
    return: concatenated and cleaned dataframe 'iris_db' as 'df'
    '''
    iris = get_iris_data()
    iris = dropped(iris, columns={'species_id', 'measurement_id'})
    iris = iris.rename(columns={'species_name':'species'})
    dummy_df = pd.get_dummies(iris[['species']], drop_first=True).astype(int)
    iris = pd.concat([iris,dummy_df], axis=1)
    return iris

In [44]:
prep_iris(iris).head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,0,0
1,4.9,3.0,1.4,0.2,setosa,0,0
2,4.7,3.2,1.3,0.2,setosa,0,0
3,4.6,3.1,1.5,0.2,setosa,0,0
4,5.0,3.6,1.4,0.2,setosa,0,0

## Using the Titanic dataset:

### 1. Use the function defined in acquire.py to load the Titanic data.

In [45]:
titanic = get_titanic_data()

### 2. Drop any unnecessary, unhelpful, or duplicated columns.

In [46]:
titanic.isna().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [47]:
titanic = dropped(titanic,columns={'deck', 'embark_town', 'pclass'})

In [48]:
round(titanic['age'].mean())
top_embarked = titanic['embarked'].describe()['top']
titanic['embarked'] = titanic['embarked'].fillna(value='top_embarked')
titanic['age'] = titanic['age'].fillna(value='30')

In [49]:
top_embarked = titanic['embarked'].describe()['top']

In [50]:
titanic['embarked'] = titanic['embarked'].fillna(value='top_embarked')

In [51]:
titanic['age'] = titanic['age'].fillna(value='30')

In [52]:
titanic.isna().sum()

passenger_id    0
survived        0
sex             0
age             0
sibsp           0
parch           0
fare            0
embarked        0
class           0
alone           0
dtype: int64

### 3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [53]:
titanic['age'] = titanic['age'].astype(int)

In [54]:
titanic.dtypes[titanic.dtypes == 'object']

sex         object
embarked    object
class       object
dtype: object

In [55]:
dummy_sex_df = pd.get_dummies(titanic[['sex']], drop_first=True).astype(int)
dummy_embarked_df = pd.get_dummies(titanic[['embarked']], drop_first=True).astype(int)
dummy_class_df = pd.get_dummies(titanic[['class']], drop_first=True).astype(int)
titanic = pd.concat([titanic, dummy_sex_df, dummy_embarked_df, dummy_class_df], axis=1)
titanic.head()

,passenger_id,survived,sex,age,sibsp,parch,fare,embarked,class,alone,sex_male,embarked_Q,embarked_S,embarked_top_embarked,class_Second,class_Third
0,0,0,male,22,1,0,7.2500,S,Third,0,1,0,1,0,0,1
1,1,1,female,38,1,0,71.2833,C,First,0,0,0,0,0,0,0
2,2,1,female,26,0,0,7.9250,S,Third,1,0,0,1,0,0,1
3,3,1,female,35,1,0,53.1000,S,First,0,0,0,1,0,0,0
4,4,0,male,35,0,0,8.0500,S,Third,1,1,0,1,0,0,1

### 4. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [6]:
titanic = get_titanic_data()

def dropped(titanic,columns={'sepal_length', 'petal_width'}):
    '''
    dropped will take the dataframe and remove any columns that are indicated,
    hopefully making the process faster
    '''
    titanic = titanic.drop(columns=columns)
    return titanic

def prep_titanic(titanic):
    '''
    prep_titanic will do all the cleaning we need of the database 'titanic_db'.
    It will:
    - drop unnecessary columns ('deck', 'embark_town', 'pclass')
    - fill in null values from columns (embarked' and 'age')
    - create dummy variables for the categorical columns 'sex', 'embarked', and 'class'
    - concatenate the previous dataframe to the new ones with dummy variables
    
    return: concatenated and cleaned dataframe 'titanic_db' as 'df'
    '''
    titanic = dropped(titanic,columns={'deck', 'embark_town', 'pclass'})
    round(titanic['age'].mean())
    top_embarked = titanic['embarked'].describe()['top']
    titanic['embarked'] = titanic['embarked'].fillna(value='top_embarked')
    titanic['age'] = titanic['age'].fillna(value='30')
    dummy_sex_df = pd.get_dummies(titanic[['sex']], drop_first=True).astype(int)
    dummy_embarked_df = pd.get_dummies(titanic[['embarked']], drop_first=True).astype(int)
    dummy_class_df = pd.get_dummies(titanic[['class']], drop_first=True).astype(int)
    titanic = pd.concat([titanic, dummy_sex_df, dummy_embarked_df, dummy_class_df], axis=1)
    return titanic

In [57]:
prep_titanic(titanic).head()

,passenger_id,survived,sex,age,sibsp,parch,fare,embarked,class,alone,sex_male,embarked_Q,embarked_S,embarked_top_embarked,class_Second,class_Third
0,0,0,male,22.0,1,0,7.2500,S,Third,0,1,0,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,C,First,0,0,0,0,0,0,0
2,2,1,female,26.0,0,0,7.9250,S,Third,1,0,0,1,0,0,1
3,3,1,female,35.0,1,0,53.1000,S,First,0,0,0,1,0,0,0
4,4,0,male,35.0,0,0,8.0500,S,Third,1,1,0,1,0,0,1

## Using the Telco dataset:

### 1. Use the function defined in acquire.py to load the Telco data.

In [58]:
telco = get_telco_data()

### 2. Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [59]:
telco.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [60]:
telco['internet_service_type'] = telco['internet_service_type'].fillna(value='No Internet')

In [61]:
telco = dropped(telco,columns={'payment_type_id', 'internet_service_type_id', 'contract_type_id'})

### 3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [62]:
telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [63]:
telco['senior_citizen'] = telco['senior_citizen'].astype(object)

In [64]:
telco['total_charges'] = telco['total_charges'].replace(' ','0').astype(float)

In [65]:
telco.dtypes[telco.dtypes == 'object']

customer_id              object
gender                   object
senior_citizen           object
partner                  object
dependents               object
phone_service            object
multiple_lines           object
online_security          object
online_backup            object
device_protection        object
tech_support             object
streaming_tv             object
streaming_movies         object
paperless_billing        object
churn                    object
contract_type            object
internet_service_type    object
payment_type             object
dtype: object

In [68]:
dummy_df = (telco[['gender', 'gender', 'partner', 'dependents', 'phone_service', 'multiple_lines',
      'online_security', 'online_backup', 'device_protection', 'tech_support',
      'streaming_tv', 'streaming_movies', 'churn', 'contract_type', 'internet_service_type', 'payment_type' ]])
telco = pd.concat([telco, dummy_df], axis=1)
telco

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,streaming_movies,streaming_movies,churn,churn,contract_type,contract_type,internet_service_type,internet_service_type,payment_type,payment_type
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,No,No,No,No,One year,One year,DSL,DSL,Mailed check,Mailed check
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,Yes,Yes,No,No,Month-to-month,Month-to-month,DSL,DSL,Mailed check,Mailed check
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,No,No,Yes,Yes,Month-to-month,Month-to-month,Fiber optic,Fiber optic,Electronic check,Electronic check
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,Yes,Yes,Yes,Yes,Month-to-month,Month-to-month,Fiber optic,Fiber optic,Electronic check,Electronic check
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,No,No,Yes,Yes,Month-to-month,Month-to-month,Fiber optic,Fiber optic,Mailed check,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,9987-LUTYD,Female,0,No,No,13,Yes,No,Yes,No,...,No,No,No,No,One year,One year,DSL,DSL,Mailed check,Mailed check
7039,9992-RRAMN,Male,0,Yes,No,22,Yes,Yes,No,No,...,Yes,Yes,Yes,Yes,Month-to-month,Month-to-month,Fiber optic,Fiber optic,Electronic check,Electronic check
7040,9992-UJOEL,Male,0,No,No,2,Yes,No,No,Yes,...,No,No,No,No,Month-to-month,Month-to-month,DSL,DSL,Mailed check,Mailed check
7041,9993-LHIEB,Male,0,Yes,Yes,67,Yes,No,Yes,No,...,Yes,Yes,No,No,Two year,Two year,DSL,DSL,Mailed check,Mailed check
7042,9995-HOTOH,Male,0,Yes,Yes,63,No,No phone service,Yes,Yes,...,Yes,Yes,No,No,Two year,Two year,DSL,DSL,Electronic check,Electronic check

### 4. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [7]:
telco = get_telco_data()

def dropped(telco,columns={'sepal_length', 'petal_width'}):
    '''
    dropped will take the dataframe and remove any columns that are indicated,
    hopefully making the process faster
    '''
    telco = telco.drop(columns=columns)
    return telco

def prep_telco(telco):
    '''
    prep_telco will do all the cleaning we need of the database 'telco_churn'.
    It will:
    - drop unnecessary columns ('payment_type_id', 'internet_service_type_id', 'contract_type_id')
    - fill in null values from columns (embarked' and 'age')
    - create dummy variables for the many categorical columns:
      - 'gender', 'partner', 'dependents', 'phone_service', 'multiple_lines',
      - 'online_security', 'online_backup', 'device_protection', 'tech_support',
      - 'streaming_tv', 'streaming_movies', 'churn', 'contract_type', 'internet_service_type', and 'payment_type'
    - concatenate the previous dataframe to the new ones with dummy variables
    
    return: concatenated and cleaned dataframe 'telco_churn' as 'df'
    '''
    telco['senior_citizen'] = telco['senior_citizen'].astype(object)
    telco['total_charges'] = telco['total_charges'].replace(' ','0').astype(float)
    dummy_df = (telco[['gender', 'gender', 'partner', 'dependents', 'phone_service', 'multiple_lines',
      'online_security', 'online_backup', 'device_protection', 'tech_support',
      'streaming_tv', 'streaming_movies', 'churn', 'contract_type', 'internet_service_type', 'payment_type' ]])
    telco = pd.concat([telco, dummy_df], axis=1)
    return telco

In [73]:
#testing the function 
prep_telco(telco)

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,No,Yes,No,Yes,Yes,No,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,No,No,No,Yes,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,Yes,No,No,No,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,No,Yes,Yes,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,No,No,No,Yes,Yes,No,Yes,Month-to-month,Fiber optic,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,2,1,2,9987-LUTYD,Female,0,No,No,13,Yes,...,Yes,No,No,Yes,No,No,No,One year,DSL,Mailed check
7039,1,2,1,9992-RRAMN,Male,0,Yes,No,22,Yes,...,No,No,No,No,No,Yes,Yes,Month-to-month,Fiber optic,Electronic check
7040,2,1,1,9992-UJOEL,Male,0,No,No,2,Yes,...,No,Yes,No,No,No,No,No,Month-to-month,DSL,Mailed check
7041,2,1,3,9993-LHIEB,Male,0,Yes,Yes,67,Yes,...,Yes,No,Yes,Yes,No,Yes,No,Two year,DSL,Mailed check
7042,1,1,3,9995-HOTOH,Male,0,Yes,Yes,63,No,...,Yes,Yes,Yes,No,Yes,Yes,No,Two year,DSL,Electronic check

## Split your data

### 1. Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

Done.

In [10]:
#importing new function from prepare
from prepare import ttv

In [75]:
ttv?

Signature: ttv(df, target)
Docstring:
ttv will take in a DataFrame and return train, validate, and test DataFrames; stratify on whatever you decide as the target in bracketed and quotations.
For example: ttv(df,['survived']) will return the dataframe (in this case the titanic dataframe and stratify by 'survived').
return train, validate, test DataFrames.
File:      ~/codeup-data-science/Classification/classification-exercises/prepare.py
Type:      function

### 2. Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

In [3]:
iris = get_iris_data()

In [12]:
iris = prep_iris(iris)

In [13]:
train_iris, validate_iris, test_iris = ttv(iris,['species'])

In [14]:
train_iris.shape

(84, 7)

In [15]:
validate_iris.shape

(36, 7)

In [16]:
test_iris.shape

(30, 7)

### 3. Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

In [17]:
titanic = get_titanic_data()

In [18]:
titanic = prep_titanic(titanic)

In [19]:
train_titanic, validate_titanic, test_titanic = ttv(titanic,['survived'])

In [20]:
train_titanic.shape

(498, 16)

In [21]:
validate_titanic.shape

(214, 16)

In [22]:
test_titanic.shape

(179, 16)

### 4. Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [23]:
telco = get_telco_data()

In [24]:
telco = prep_telco(telco)

In [25]:
train_telco, validate_telco, test_telco = ttv(telco,['churn'])

In [26]:
train_telco.shape

(3943, 40)

In [27]:
validate_telco.shape

(1691, 40)

In [28]:
test_telco.shape

(1409, 40)